In [69]:
import pandas as pd

In [71]:
df = pd.read_csv('17_Fitness Centers â€“ Members & Classes with Instructors_merged.csv')

In [73]:
df.head(3)

,member_id,class_id,registration_date,status,member_name,age,membership_level,class_name,schedule,trainer,instructor_id,instructor_name,certification
0,449,82,1/24/2025,Cancelled,Paul Brewer,35,Basic,hand,0:42:50,Kyle Goodwin,31,Laura Burke,within
1,512,95,1/9/2025,Cancelled,Scott Cooper,54,Basic,their,1:12:45,Nichole Ford,33,Donna Aguirre,little
2,979,100,2/9/2025,Cancelled,Nancy Mack,25,Premium,young,14:24:29,Joshua Flores,11,Justin Suarez,compare

In [75]:
df.sort_values('member_id').head(6)

,member_id,class_id,registration_date,status,member_name,age,membership_level,class_name,schedule,trainer,instructor_id,instructor_name,certification
1082,1,11,2/1/2025,Active,David Payne,55,Premium,fight,4:50:39,Julia Morales,7,Kimberly Stark,everyone
1245,3,81,1/16/2025,Cancelled,Eric Hayes,56,Basic,east,1:01:57,Joshua Smith,46,Nicole Santos,end
458,3,67,2/17/2025,Cancelled,Eric Hayes,56,Basic,bag,5:44:35,Bobby Ray DDS,15,Elizabeth Wilson,performance
1490,3,90,1/19/2025,Active,Eric Hayes,56,Basic,score,5:18:01,Christopher Lloyd,9,Amber Morgan,visit
1176,5,16,2/21/2025,Active,Kyle Bradshaw,63,Basic,however,18:18:30,Veronica Patel,44,Mark Guerra,why
921,5,92,1/15/2025,Cancelled,Kyle Bradshaw,63,Basic,reason,18:26:28,Gary Costa,36,Donald Day,big

In [77]:
Member = df.loc[:,['member_id','member_name','age','membership_level']]

In [81]:
Member.head(3)

   member_id   member_name  age membership_level
0        449   Paul Brewer   35            Basic
1        512  Scott Cooper   54            Basic
2        979    Nancy Mack   25          Premium

In [83]:
Member.columns=['id', 'name', 'age', 'level']

In [85]:
len(Member['id'].unique())

769

In [87]:
len(Member)

1500

In [89]:
Member.drop_duplicates(subset='id',inplace=True)

In [91]:
len(Member)

769

In [93]:
Member.head(3)

    id          name  age    level
0  449   Paul Brewer   35    Basic
1  512  Scott Cooper   54    Basic
2  979    Nancy Mack   25  Premium

In [95]:
from sqlalchemy import create_engine

In [97]:
engine = create_engine('sqlite:///gym.db')

In [99]:
Member.to_sql('member', con =engine, if_exists='replace', index=False)

769

In [101]:
engine.dispose()